app/controllers/authors_controller.rb

  def show
    @author = Author.find(params[:id])
    @post = @author.posts.first
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" ASC LIMIT ?  [["author_id", 1], ["LIMIT", 1]]